Autodesk.Revit.DB.IFamilyLoadOptions.OnSharedFamilyFound(Autodesk.Revit.DB.Family,System.Boolean,Autodesk.Revit.DB.FamilySource@,System.Boolean@)
A method called when the shared family was found in the target document.
Remarks:
Triggered only when the family is both loaded and changed.
sharedFamily:
The shared family in the current family document.
familyInUse:
Indicates if one or more instances of the family is placed in the project.
source:
This indicates if the family will load from
the project or the current family.
overwriteParameterValues:
This indicates whether or not to overwrite the parameter
values of existing types.
Returns:
Return true to continue loading the family, false to cancel.

Autodesk.Revit.DB.IFamilyLoadOptions.OnFamilyFound(System.Boolean,System.Boolean@)
A method called when the family was found in the target document.
Remarks:
Triggered only when the family is both loaded and changed.
familyInUse:
Indicates if one or more instances of the family is placed in the project.
overwriteParameterValues:
This determines whether or not to overwrite the parameter
values of existing types. The default value is false.
Returns:
Return true to continue loading the family, false to cancel.

Autodesk.Revit.DB.IFamilyLoadOptions
An interface class which provide the callback for family load options.
Remarks:
If the family is not loaded, or if the family is loaded but unchanged, the situation will never trigger and Autodesk.Revit.DB.IFamilyLoadOptions.OnFamilyFound(System.Boolean,System.Boolean@) and Autodesk.Revit.DB.IFamilyLoadOptions.OnSharedFamilyFound(Autodesk.Revit.DB.Family,System.Boolean,Autodesk.Revit.DB.FamilySource@,System.Boolean@) will not be called.
Only if the family is loaded and changed should the interface methods be called.